{"totalArticles":4294,"articles":[{"title":"Liverpool are already getting what they wanted from Harvey Elliott loan deal","description":"Harvey Elliott looked very promising in his preferred position for Blackburn Rovers in his first two games","content":"Stay up to date ahead of the Derby with the LFC newsletter Subscribe now Thank you for subscribing We have more newsletters Show me See our privacy notice Invalid Email\nWhen Jurgen Klopp arrived in English football, there were certain cultural adjust... [3761 chars]","url":"https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-harvey-elliott-jurgen-klopp-19157174","image":"https://i2-prod.liverpoolecho.co.uk/incoming/article19163951.ece/ALTERNATES/s1200/0_JS221637820.jpg","publishedAt":"2020-10-26T05:00:00Z","source":{"name":"Liverpool Echo","url":"https://www.liverpoolecho.co.uk"}},{"title":"World War 3: most powerful military alliance ever","description":"CHINA and Russia could join forces in a military affiliation more powerful than the US, Russian President Vladimir Putin has suggested.","content":"FREE now and never miss the top politics stories again. SUBSCRIBE Invalid email Sign up fornow and never miss the top politics stories again. We will use your email address only for sending you newsletters. Please see our Privacy Notice for details o... [2058 chars]","url":"https://www.express.co.uk/news/world/1352216/world-war-3-china-news-russia-vladimir-putin-donald-trump-us-army-xi-jinping-ont","image":"https://cdn.images.express.co.uk/img/dynamic/78/750x445/1352216.jpg","publishedAt":"2020-10-26T04:12:00Z","source":{"name":"Daily Express","url":"https://www.express.co.uk"}},{"title":"Hamilton left wondering when racing edge will finally desert him","description":"Lewis Hamilton has been left wondering when he will suffer a performance drop off in the wake of setting a new Formula 1 record for race wins following...","content":"Lewis Hamilton has been left wondering when he will suffer a performance drop off in the wake of setting a new Formula 1 record for race wins following his victory in the Portuguese Grand Prix.\nThe six-time champion, though, is hoping his dominant tr... [1912 chars]","url":"https://www.gpfans.com/en/articles/58472/hamilton-left-wondering-when-racing-edge-will-finally-desert-him/","image":"https://sportsbase.io/images/gpfans/copy_704x396/5ce6f56530262fae352e03d77055c40b34e783df.jpg","publishedAt":"2020-10-26T03:01:33Z","source":{"name":"GPfans","url":"https://www.gpfans.com"}},{"title":"How a ten-hour standoff on an oil tanker near the Isle of Wight ended in just nine minutes","description":"'Security in third world ports is not as high as in the first world, so it is relatively easy to get through perimeter fences'","content":"It is understood that as the ship approached British waters, the crew tried to detain the stowaways in a cabin, but they got violent and that sparked the security incident.\nLawyers for Navios Tankers Management Inc, the Greek company who own the ship... [3294 chars]","url":"https://www.telegraph.co.uk/news/2020/10/25/ten-hour-standoff-oil-tanker-near-isle-wight-ended-just-nine/","image":"https://www.telegraph.co.uk/content/dam/news/2020/10/25/TELEMMGLPICT000242887759_trans_NvBQzQNjv4BqaRL1kC4G7DT9ZsZm6Pe3PehAFAI_f6ud569StXyOKH0.jpeg?impolicy=logo-overlay","publishedAt":"2020-10-26T00:27:00Z","source":{"name":"Telegraph.co.uk","url":"https://www.telegraph.co.uk"}},{"title":"Until Dawn PS4 Improvements Are Unfortunately Wishful Thinking","description":"Game hasn't been patched in years - There are some reports swirling that Until Dawn’s loading times, like The Last of Us...","content":"There are some reports swirling that Until Dawn’s loading times, like The Last of Us Remastered, have been improved on the PlayStation 4. This all started with a post on Twitter, but it’s since been upvoted on Reddit, and has even been posted on some... [500 chars]","url":"https://www.pushsquare.com/news/2020/10/until_dawn_ps4_improvements_are_unfortunately_wishful_thinking","image":"https://images.pushsquare.com/acaad2a401a3d/1280x720.jpg","publishedAt":"2020-10-26T00:00:00Z","source":{"name":"Push Square","url":"https://www.pushsquare.com"}},{"title":"M40 traffic latest: 14 cars crash on M40 in Buckinghamshire - 20 injured","description":"AT LEAST 14 cars have crashed on the M40 in Buckinghamshire, leading to 20 people being injured.","content":"We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights.\nSign up fornow and never miss the top politics stories again.\nSouth Central Ambulance service tweeted: \"A large... [633 chars]","url":"https://www.express.co.uk/news/uk/1352192/M40-traffic-latest-car-crash-loudwater-Buckinghamshire-thames-valley-travel-latest","image":"https://cdn.images.express.co.uk/img/dynamic/1/750x445/1352192.jpg","publishedAt":"2020-10-25T22:37:00Z","source":{"name":"Express","url":"https://www.express.co.uk"}},{"title":"Mercedes boss Toto Wolff ready to go to extreme lengths to keep Lewis Hamilton on board","description":"JONATHAN McEVOY IN PORTIMAO: The Brit is out of contract at the end of the season but both he and Mercedes want to extend their partnership and Wolff joked he would go to extreme lengths.","content":"Mercedes boss Toto Wolff is ready to sell the team's factories to keep Lewis Hamilton after his latest record-breaking victory on Sunday.\nHamilton made history at the Portuguese Grand Prix with the 92nd win of his career to move one clear of Michael ... [2970 chars]","url":"https://www.dailymail.co.uk/sport/formulaone/article-8878281/Mercedes-boss-Toto-Wolff-ready-extreme-lengths-Lewis-Hamilton-board.html","image":"https://i.dailymail.co.uk/1s/2020/10/25/22/34829560-0-image-a-11_1603663347597.jpg","publishedAt":"2020-10-25T22:33:00Z","source":{"name":"Daily Mail","url":"https://www.dailymail.co.uk"}},{"title":"Man Utd boss Ole Gunnar Solskjaer facing increasing scrutiny over Donny van de Beek snubs","description":"The Dutch midfielder has failed to start any of United's five Premier League matches sine he joined the club from Ajax in the summer in a £40million deal","content":"Come on in and join the club! Get our daily Manchester United email newsletter Sign me up! Thank you for subscribing We have more newsletters Show me See our privacy notice Invalid Email\nDonny van de Beek was all smiles as he chatted to David De Gea ... [4125 chars]","url":"https://www.mirror.co.uk/sport/football/news/van-de-beek-man-utd-22904464","image":"https://i2-prod.mirror.co.uk/incoming/article22904468.ece/ALTERNATES/s1200/0_van-de-beekjpeg.jpg","publishedAt":"2020-10-25T22:30:00Z","source":{"name":"Mirror Online","url":"https://www.mirror.co.uk"}},{"title":"José Mourinho's free-scoring Spurs give fans something to cheer about","description":"The Tottenham manager, who has been criticised in the past for pragmatic tactics, is making the most of his attacking riches","content":"The Tottenham manager, who has been criticised in the past for pragmatic tactics, is making the most of his attacking riches\nJosé Mourinho has one regret, and it was reinforced last Thursday night when his Tottenham team continued their free-scoring ... [5229 chars]","url":"https://www.theguardian.com/football/2020/oct/25/jose-mourinhos-free-scoring-spurs-give-fans-something-to-cheer-about","image":"https://i.guim.co.uk/img/media/55a8c8207ba287661d9436d12ca4ec0aefdb91b9/202_0_2473_1485/master/2473.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=611e905c12028c837a8fd54df8d62f90","publishedAt":"2020-10-25T22:30:00Z","source":{"name":"The Guardian","url":"https://www.theguardian.com"}},{"title":"12-minute Covid test expected to be available at Boots within weeks","description":"The test has proved 97% accurate and should be available within a fortnight. But the chain is also offering a 48-hour service from today and hopes 200 UK branches will have both by Christmas.","content":"Boots is launching a coronavirus testing service with results in just 12 minutes.\nThe high-speed test has proved 97 per cent accurate in trials and should be available within a fortnight. But the chain is also offering a 48-hour service from today an... [7692 chars]","url":"https://www.dailymail.co.uk/news/article-8878251/12-minute-Covid-test-expected-available-Boots-weeks.html","image":"https://i.dailymail.co.uk/1s/2020/10/25/22/34830696-0-image-a-39_1603664156938.jpg","publishedAt":"2020-10-25T22:06:00Z","source":{"name":"Daily Mail","url":"https://www.dailymail.co.uk"}}]}