{"totalArticles":1634,"articles":[{"title":"TOWIE's Frankie Sims enjoys a night on the town with her sister Demi","description":"Frankie, 25, who has reportedly split from boyfriend Harry Lee, also 25, showcased her sense of style in a mauve top with a black print and a purple hemline.","content":"They are sisters who both rose to fame when they began appearing alongside their older sibling Chloe on The Only Way Is Essex.\nAnd Frankie and Demi Sims looked nothing short of sensational as they enjoyed a night on the town on Sunday.\nFrankie, who h... [2236 chars]","url":"https://www.dailymail.co.uk/tvshowbiz/article-8878771/TOWIEs-Frankie-Sims-enjoys-night-town-sister-Demi.html","image":"https://i.dailymail.co.uk/1s/2020/10/26/01/34836060-0-image-a-127_1603676301785.jpg","publishedAt":"2020-10-26T01:49:00Z","source":{"name":"Daily Mail","url":"https://www.dailymail.co.uk"}},{"title":"Sunday Game pundits fear cynicism creeping into hurling","description":"The old cliché about there being no cynicism in hurling is laughable these days but two Sunday Game panelists believe there is still no need to introduce the black card to the game.","content":"The old cliché about there being no cynicism in hurling is laughable these days but two Sunday Game panelists believe there is still no need to introduce the black card to the game.\nThe rule to prevent deliberate cynical foul play was brought into fo... [1938 chars]","url":"https://www.rte.ie/sport/gaa/2020/1025/1173902-cynicism-in-hurling/","image":"https://img.rasset.ie/00158e49-1600.jpg","publishedAt":"2020-10-25T23:45:32Z","source":{"name":"RTE.ie","url":"https://www.rte.ie"}},{"title":"President Higgins signs controversial Mother and Baby Homes Bill into law after 'careful consideration'","description":"President Higgins said the issues raised were 'serious and must be addressed' but the Bill itself did not raise a constitutional issue","content":"Get all the very latest news in Ireland straight to your email every single day Sign up! Thank you for subscribing See our privacy notice Invalid Email\nPresident Michael D Higgins has signed a controversial Mother and Baby Homes Bill into law after \"... [2729 chars]","url":"https://www.irishmirror.ie/news/irish-news/politics/president-higgins-signs-controversial-mother-22904916","image":"https://i2-prod.irishmirror.ie/incoming/article21958658.ece/ALTERNATES/s1200/0_Screen-Shot-2020-05-01-at-135642.png","publishedAt":"2020-10-25T22:33:00Z","source":{"name":"Irish Mirror","url":"https://www.irishmirror.ie"}},{"title":"More deaths on Irish roads in 2020 than 2019 so far despite lockdown traffic drop","description":"So far 118 people have been killed, compared to 111 in 2019","content":"Get all the very latest news in Dublin straight to your email every single day Sign Up! Thank you for subscribing See our privacy notice Invalid Email\nMore people have died on Irish roads in 2020 than at this point last year even with the drop in tra... [3384 chars]","url":"https://www.dublinlive.ie/news/more-deaths-irish-roads-2020-19164815","image":"https://i2-prod.dublinlive.ie/incoming/article18190695.ece/ALTERNATES/s1200/0_I200502_192429_2895460oTextTRMRMMGLPICT000211366893o.jpg","publishedAt":"2020-10-25T22:08:00Z","source":{"name":"Dublin Live","url":"https://www.dublinlive.ie"}},{"title":"Five-try Connacht produce the goods in Edinburgh","description":"Connacht produced a scintillating performance to record a fine 37-26 win away to Edinburgh in the Guinness Pro14.","content":"Connacht produced a scintillating performance to record a fine 37-26 win away to Edinburgh in the Guinness Pro14.\nTries from Caolin Blade, Sam Arnold, Alex Wootton (2) and Shane Delahunt secured a five-point haul and moves the westerners up to joint ... [2460 chars]","url":"https://www.rte.ie/sport/rugby/2020/1025/1173825-edinburgh-26-37-connacht/","image":"https://img.rasset.ie/00158e36-1600.jpg","publishedAt":"2020-10-25T21:29:28Z","source":{"name":"RTE.ie","url":"https://www.rte.ie"}},{"title":"Joyce fears Covid close contact rule could prove costly","description":"Galway manager Pádraic Joyce fears that the close contact rule relating to positive Covid-19 tests could potentially wreak havoc on this year's championship.","content":"Galway manager Pádraic Joyce fears that the close contact rule relating to positive Covid-19 tests could potentially wreak havoc on this year's championship.\nThe Tribesmen finished off their Allianz League campaign in Salthill on Sunday, losing a clo... [3142 chars]","url":"https://www.rte.ie/sport/gaa/2020/1025/1173894-joyce-fears-covid-close-contact-rule-could-prove-costly/","image":"https://img.rasset.ie/00158e32-1600.jpg","publishedAt":"2020-10-25T21:12:16Z","source":{"name":"RTE.ie","url":"https://www.rte.ie"}},{"title":"Armed forces gain control of tanker in English channel","description":"Seven people have been detained after armed forces personnel boarded an oil tanker off the Isle of Wight in Britain, following reports its crew had been threatened by stowaways.","content":"Seven people have been detained after armed forces personnel boarded an oil tanker off the Isle of Wight in Britain, following reports its crew had been threatened by stowaways.\nHampshire police had requested military assistance in dealing with the s... [2474 chars]","url":"https://www.rte.ie/news/world/2020/1025/1173863-tanker-uk/","image":"https://img.rasset.ie/00158e38-1600.jpg","publishedAt":"2020-10-25T21:00:00Z","source":{"name":"RTE.ie","url":"https://www.rte.ie"}},{"title":"Kiely hoping to use match sharpness in quick turnaround","description":"Limerick manager John Kiely says he's hopeful his team can make use of the advantage of having already played a game when they take on Tipperary in the Munster SHC semi-final next weekend.","content":"Limerick manager John Kiely is hopeful that his team can make use of the advantage of having already played a game when they take on Tipperary in the Munster SHC semi-final next weekend.\nA strong second-half showing at Thurles on Sunday eased the 201... [3192 chars]","url":"https://www.rte.ie/sport/gaa/2020/1025/1173881-kiely-hoping-to-use-match-sharpness-in-quick-turnaround/","image":"https://img.rasset.ie/00158de7-1600.jpg","publishedAt":"2020-10-25T20:26:38Z","source":{"name":"RTE.ie","url":"https://www.rte.ie"}},{"title":"1,025 more cases of Covid-19, no further deaths","description":"The Department of Health has reported a further 1,025 cases of Covid-19 and no further deaths.","content":"The Department of Health has reported a further 1,025 cases of Covid-19, bringing the total number of confirmed cases to 57,128.\nNo more deaths have occurred. There has been a total of 1,882 Covid-19 related deaths in Ireland.\nAs of 2pm today, 315 pa... [4264 chars]","url":"https://www.rte.ie/news/2020/1025/1173867-latest-covid-figures/","image":"https://img.rasset.ie/0013f3e4-1600.jpg","publishedAt":"2020-10-25T18:00:00Z","source":{"name":"RTE.ie","url":"https://www.rte.ie"}},{"title":"Covid-19 Ireland: No deaths and 1,025 new cases confirmed with 147 in Cork","description":"The latest figures have been released","content":"Sign up to FREE email alerts from Cork Beo - Daily Subscribe Thank you for subscribing See our privacy notice Invalid Email\nThe Department of Health have announced 1,025 new cases of Covid-19 in Ireland today.\nThe total amount of people who have been... [1190 chars]","url":"https://www.corkbeo.ie/news/local-news/covid-19-ireland-no-deaths-19164001","image":"https://i2-prod.corkbeo.ie/incoming/article19052964.ece/ALTERNATES/s1200/1_CC-19TH-MAY-COVID-PRESS-CONF1090460875.jpg","publishedAt":"2020-10-25T17:39:00Z","source":{"name":"Cork Beo","url":"https://www.corkbeo.ie"}}]}